In [19]:
import pandas as pd

### Intro to Dataframes

In [20]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=["A","B","C"],index=["x","y","z"])

In [21]:
df.head()

   A  B  C
x  1  2  3
y  4  5  6
z  7  8  9

In [22]:
df.head(2)

   A  B  C
x  1  2  3
y  4  5  6

In [23]:
df.tail(2)

   A  B  C
y  4  5  6
z  7  8  9

In [24]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [25]:
df.index.tolist()

['x', 'y', 'z']

In [26]:
df.describe()

         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [28]:
df.shape

(3, 3)

## Loading in data from files

In [30]:
coffee = pd.read_csv("coffee.csv")

## Accesing data

In [31]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [32]:
coffee.sample(5)  # Random 5 rows

         Day Coffee Type  Units Sold
1     Monday       Latte          15
7   Thursday       Latte          30
13    Sunday       Latte          35
2    Tuesday    Espresso          30
3    Tuesday       Latte          20

In [33]:
coffee.loc[0]

Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object

In [34]:
coffee.loc[[0,1,2]]

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30

In [36]:
coffee.loc[5:12,["Coffee Type","Units Sold"]]

   Coffee Type  Units Sold
5        Latte          25
6     Espresso          40
7        Latte          30
8     Espresso          45
9        Latte          35
10    Espresso          45
11       Latte          35
12    Espresso          45

In [38]:
coffee.iloc[:,[1,2]]

   Coffee Type  Units Sold
0     Espresso          25
1        Latte          15
2     Espresso          30
3        Latte          20
4     Espresso          35
5        Latte          25
6     Espresso          40
7        Latte          30
8     Espresso          45
9        Latte          35
10    Espresso          45
11       Latte          35
12    Espresso          45
13       Latte          35

In [40]:
coffee.loc[1,"Units Sold"] = 25
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          25
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [45]:
coffee.at[0,"Units Sold"]

np.int64(25)

In [49]:
coffee.iat[0,0]

'Monday'

In [52]:
coffee.Day

0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

In [53]:
coffee["Coffee Type"]

0     Espresso
1        Latte
2     Espresso
3        Latte
4     Espresso
5        Latte
6     Espresso
7        Latte
8     Espresso
9        Latte
10    Espresso
11       Latte
12    Espresso
13       Latte
Name: Coffee Type, dtype: object

In [56]:
coffee.sort_values(["Units Sold","Coffee Type"],ascending=[0,1])

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
1      Monday       Latte          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20